InformationRegisters/УчетнаяПолитикаПоПерсоналуОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>УчетнаяПолитикаПоПерсоналуОрганизаций</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВестиУчетПоГоловнойОрганизации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УчитыватьКадровыеПерестановкиПриРасчетеСреднегоЗаработка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантУчетаКадровыхПерестановок</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыУчетаКадровыхПерестановок</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РасчетКоэффициентаНарастающимИтогом</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РассчитыватьКоэффициентИндексацииВПределахКадровыхПерестановок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/РаботникиОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>РаботникиОрганизаций</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗанимаемыхСтавок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаИзмененияСостояния</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныИзмененияСостояния</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбособленноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтруктурноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсчислятьОППВ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СтатьяЗаконаОТрудеРК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОснованияУвольненияИзОрганизации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыЗанятостиВОрганизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ВидыЗанятостиВОрганизации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОсновноеМестоРаботы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Совместительство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнутреннееСовместительство</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/КадровоеПеремещениеОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>КадровоеПеремещениеОрганизаций</Name>
			<BasedOn>
				<xr:Item>Catalog.СотрудникиОрганизаций</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.РаботникиОрганизаций</xr:Item>
				<xr:Item>InformationRegister.ПлановыеНачисленияРаботниковОрганизаций</xr:Item>
				<xr:Item>InformationRegister.КоэффициентыИндексацииЗаработка</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИндексацияЗаработка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффициентИндексацииЗаработка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбособленноеПодразделениеКуда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбособленноеПодразделениеОткуда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурноеПодразделениеОткуда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурноеПодразделениеКуда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РаботникиОрганизации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФизЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПодразделениеОрганизации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИсчислятьОППВ</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОсновныеНачисления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФизЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Действие</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыДействияСНачислением</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРасчета</Name>
							<Type>
								<v8:Type>cfg:ChartOfCalculationTypesRef.ОсновныеНачисленияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Размер</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/СотрудникиОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>СотрудникиОрганизаций</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Catalog.ФизическиеЛица</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Comment>Обособленное подразделение</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурноеПодразделение</Name>
					<Comment>Структурная единица</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Физлицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Актуальность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗанятости</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЗанятостиВОрганизации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПостфиксНаименования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущаяСтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущееСтруктурноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущееПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущаяДолжностьОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПриемаНаРаботу</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУвольнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НаборыЗначенийДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерНабора</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеДоступа</Name>
							<Comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЗначениеДоступа</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Чтение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Изменение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Уточнение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/УчетнаяПолитикаПоПерсоналуОрганизаций/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Включение режима ведения учета по головной организации
// Производит замену значения измерения "Организация" в регистрах
// на головную организацию
//
// Параметры:
//  Организация
//
// Возвращаемое значение:
//  Истина	- если действе выполнено успешно
//	Ложь	- если действе выполнено неуспешно
//
Функция ВключениеВеденияУчетаПоГоловнойОрганизации(Организация) Экспорт
	
	ГоловнаяОрганизация = Организация.ГоловнаяОрганизация;
	Если НЕ ЗначениеЗаполнено(ГоловнаяОрганизация) Тогда
		Возврат Истина;		
	КонецЕсли;
	
	Если Организация <> ГоловнаяОрганизация Тогда
		Если НЕ(МожноВключатьВедениеУчетаПоГоловнойОрганизации(Организация)) Тогда
			ОбщегоНазначения.СообщитьПользователю(
				НСтр("ru='Включить ведение учета по головной организации невозможно, т.к. некоторые сотрудники работают одновременно по внешнему совместительству и основному месту работы в организации-филиале и головной организации!'")
			);
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
    	
	СписокРегистров = Новый СписокЗначений;
	СписокРегистров.Добавить("РаботникиОрганизаций", НСтр("ru = 'Кадровая история сотрудников'"));
	СписокРегистров.Добавить("ПлановыеНачисленияРаботниковОрганизаций", НСтр("ru = 'Плановые начисления сотрудников организаций'"));
	СписокРегистров.Добавить("ПлановыеУдержанияРаботниковОрганизаций", НСтр("ru = 'Плановые удержания сотрудников организаций'"));
	СписокРегистров.Добавить("КоэффициентыИндексацииЗаработка", НСтр("ru = 'Коэффициенты индексации заработка'"));
	СписокРегистров.Добавить("РеглУчетПлановыхНачисленийРаботниковОрганизаций", НСтр("ru = 'Регл. учет плановых начислений сотрудников организаций'"));
	
	Для Каждого Регистр Из СписокРегистров Цикл
		
		ВключениеВеденияУчетаПоГоловнойОрганизации = Истина;
		ОбработатьРегистрДляВеденияУчетаПоГоловнойОрганизации(Организация, Регистр.Значение, Регистр.Представление, ВключениеВеденияУчетаПоГоловнойОрганизации);
		
	КонецЦикла;
	
	// в Кадровых перемещениях, если перемещение происходило в пределах одного филиала
	// заменим реквизит Организация, содержащий ссылку на филиал
	// на головную организацию	
	
	Если Организация <> ГоловнаяОрганизация Тогда
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	КадровоеПеремещениеОрганизаций.Ссылка
		|ИЗ
		|	Документ.КадровоеПеремещениеОрганизаций КАК КадровоеПеремещениеОрганизаций
		|ГДЕ
		|	КадровоеПеремещениеОрганизаций.Организация = &Организация
		|	И КадровоеПеремещениеОрганизаций.Проведен");
		
		Запрос.УстановитьПараметр("ГоловнаяОрганизация", ГоловнаяОрганизация);
		Запрос.УстановитьПараметр("Организация", Организация);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Документ = Выборка.Ссылка.ПолучитьОбъект();
			Документ.Организация = ГоловнаяОрганизация;
			Документ.ОбособленноеПодразделениеКуда   = Организация;
			Документ.ОбособленноеПодразделениеОткуда = Организация;
			Документ.Записать();		
		КонецЦикла;       	
	КонецЕсли;
	
	// В справочник СотрудникиОрганизаций заменим значение реквизита Организация
	// на значение головной организации
	
	Если Организация <> ГоловнаяОрганизация Тогда
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	СотрудникиОрганизаций.Ссылка
		|ИЗ
		|	Справочник.СотрудникиОрганизаций КАК СотрудникиОрганизаций
		|ГДЕ
		|	СотрудникиОрганизаций.Организация = &Организация");		
		
		Запрос.УстановитьПараметр("Организация", Организация);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Справочник = Выборка.Ссылка.ПолучитьОбъект();
			Справочник.Организация = ГоловнаяОрганизация;			
			Справочник.Записать();		
		КонецЦикла;       	
	КонецЕсли;
		
	Возврат Истина;		
	
КонецФункции

// Отключение режима ведения учета по головной организации
// Производит замену значения измерения "Организация" в регистрах
// с головной организации на организацию
//
// Отключение режима ведения учета по головной организации возможно только
// в том случае, если не было кадровых перемещений по данной организации
// из головы в филиал, или из филиала в голову
//
// Параметры:
//  Организация
//
// Возвращаемое значение:
//  Истина	- если действе выполнено успешно
//	Ложь	- если действе выполнено неуспешно
//
Функция ВыключениеВеденияУчетаПоГоловнойОрганизации(Организация) Экспорт
	
	ГоловнаяОрганизация = Организация.ГоловнаяОрганизация;
	Если НЕ ЗначениеЗаполнено(ГоловнаяОрганизация) Тогда
		Возврат Истина;		
	КонецЕсли;
	
	// проверим можно ли снять признак ведения учета по головной организации
	// если были Кадровые перемещения из филиала в голову - то запрещаем снимать признак
	Если НЕ (МожноОтключатьВедениеУчетаПоГоловнойОрганизации(Организация)) Тогда
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Отключить ведение учета по головной организации невозможно, т.к. есть кадровые перемещения по данной организации!'")
		);
		Возврат Ложь;		
	КонецЕсли;
		
	СписокРегистров = Новый СписокЗначений;
	СписокРегистров.Добавить("РаботникиОрганизаций", НСтр("ru = 'Кадровая история сотрудников'"));
	СписокРегистров.Добавить("ПлановыеНачисленияРаботниковОрганизаций",  НСтр("ru = 'Плановые начисления сотрудников организаций'"));
	СписокРегистров.Добавить("ПлановыеУдержанияРаботниковОрганизаций",  НСтр("ru = 'Плановые удержания сотрудников организаций'"));
	СписокРегистров.Добавить("КоэффициентыИндексацииЗаработка",  НСтр("ru = 'Коэффициенты индексации заработка'"));
	СписокРегистров.Добавить("РеглУчетПлановыхНачисленийРаботниковОрганизаций",  НСтр("ru = 'Регл. учет плановых начислений сотрудников организаций'"));
	
	Для Каждого Регистр Из СписокРегистров Цикл
		
		ВключениеВеденияУчетаПоГоловнойОрганизации = Ложь;
		ОбработатьРегистрДляВеденияУчетаПоГоловнойОрганизации(Организация, Регистр.Значение, Регистр.Представление, ВключениеВеденияУчетаПоГоловнойОрганизации);
		
	КонецЦикла;
	
	// в Кадровых перемещениях, если перемещение происходило в пределах одного филиала
	// нужно заменить реквизит Организация, содержащий ссылку на голову
	// на ссылку на организацию-филиал, не ведущий учет по голове
	// Документы "Кадровое перемещение", где ОбособленноеПодразделениеОткуда = ОбособленноеПодразделениеКуда = Организация
	
	Если Организация <> ГоловнаяОрганизация Тогда
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	КадровоеПеремещениеОрганизаций.Ссылка
		|ИЗ
		|	Документ.КадровоеПеремещениеОрганизаций КАК КадровоеПеремещениеОрганизаций
		|ГДЕ
		|	КадровоеПеремещениеОрганизаций.Организация = &ГоловнаяОрганизация
		|	И КадровоеПеремещениеОрганизаций.Проведен
		|	И (КадровоеПеремещениеОрганизаций.ОбособленноеПодразделениеКуда = &Организация
		|			ИЛИ КадровоеПеремещениеОрганизаций.ОбособленноеПодразделениеОткуда = &Организация)
		|	И КадровоеПеремещениеОрганизаций.ОбособленноеПодразделениеКуда = КадровоеПеремещениеОрганизаций.ОбособленноеПодразделениеОткуда");
		
		Запрос.УстановитьПараметр("ГоловнаяОрганизация", ГоловнаяОрганизация);
		Запрос.УстановитьПараметр("Организация", Организация);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Документ = Выборка.Ссылка.ПолучитьОбъект();
			Документ.Организация = Организация;
			Документ.Записать();		
		КонецЦикла;       	
	КонецЕсли;
	
	// В справочнике "Сотрудники организации"
	Если Организация <> ГоловнаяОрганизация Тогда
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	СотрудникиОрганизаций.Ссылка
		|ИЗ
		|	Справочник.СотрудникиОрганизаций КАК СотрудникиОрганизаций
		|ГДЕ
		|	СотрудникиОрганизаций.ТекущаяСтруктурнаяЕдиница = &Организация
		|   ИЛИ (СотрудникиОрганизаций.ТекущаяСтруктурнаяЕдиница = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|	И СотрудникиОрганизаций.СтруктурнаяЕдиница = &Организация)");		
				
		Запрос.УстановитьПараметр("Организация", Организация);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Справочник = Выборка.Ссылка.ПолучитьОбъект();
			Справочник.Организация = Организация;
			Справочник.Записать();		
		КонецЦикла;       	
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Функция проверяет можно ли отключать ведение учета по головной организации
//
// Параметры: 
//	нет
//
// Возвращаемое значение:
//  Истина - можно отключать, Ложь - существуют кадровые перемещения в пределах головной организации =>
//	отключение невозможно
//
// Описание:
//  Проверяет, есть ли кадровые перемещения 
//
Функция МожноОтключатьВедениеУчетаПоГоловнойОрганизации(Организация)
					
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	КадровоеПеремещениеОрганизаций.Ссылка
	|ИЗ
	|	Документ.КадровоеПеремещениеОрганизаций КАК КадровоеПеремещениеОрганизаций
	|ГДЕ
	|	КадровоеПеремещениеОрганизаций.Организация = &ГоловнаяОрганизация
	|	И КадровоеПеремещениеОрганизаций.Проведен
	|	И (КадровоеПеремещениеОрганизаций.ОбособленноеПодразделениеКуда = &Организация
	|			ИЛИ КадровоеПеремещениеОрганизаций.ОбособленноеПодразделениеОткуда = &Организация)
	|	И КадровоеПеремещениеОрганизаций.ОбособленноеПодразделениеКуда <> КадровоеПеремещениеОрганизаций.ОбособленноеПодразделениеОткуда");
	
	Запрос.УстановитьПараметр("ГоловнаяОрганизация",Организация.ГоловнаяОрганизация);
	Запрос.УстановитьПараметр("Организация",Организация);
	
	Возврат Запрос.Выполнить().Пустой();

КонецФункции

// Функция проверяет можно ли включать ведение учета по головной организации
//
// Параметры: 
//	нет
//
// Возвращаемое значение:
//  Истина - можно включать, Ложь - существуют работники, принятые по внешнему совместительству и основному месту работу
//  одновременно по головной организации и филиалу =>
//	включение ведения учета по головной организации невозможно
//
// Описание:
//  Проверяет, есть ли работники, принятые в один и тот же период по основному месту работы и внешнему совместительству
//  либо принятые и уволенные работники в один день
//
Функция МожноВключатьВедениеУчетаПоГоловнойОрганизации(Организация)
					
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	КоличествоДублирующихсяЗаписей.Сотрудник,
	|	КоличествоДублирующихсяЗаписей.Период,
	|	КоличествоДублирующихсяЗаписей.КоличествоПериодов
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЗаписиРегистра.Сотрудник КАК Сотрудник,
	|		ЗаписиРегистра.Период КАК Период,
	|		КОЛИЧЕСТВО(ЗаписиРегистра.Период) КАК КоличествоПериодов
	|	ИЗ
	|		(ВЫБРАТЬ
	|			РаботникиОрганизаций.Период КАК Период,
	|			1 КАК ПериодКоличество,
	|			РаботникиОрганизаций.Сотрудник КАК Сотрудник,
	|			РаботникиОрганизаций.Организация КАК Организация,
	|			РаботникиОрганизаций.ОбособленноеПодразделение КАК ОбособленноеПодразделение
	|		ИЗ
	|			РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
	|		ГДЕ
	|			(РаботникиОрганизаций.Организация = &ГоловнаяОрганизация
	|					ИЛИ РаботникиОрганизаций.Организация = &Организация)
	|			И РаботникиОрганизаций.Сотрудник.ВидЗанятости <> ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство)) КАК ЗаписиРегистра
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ЗаписиРегистра.Сотрудник,
	|		ЗаписиРегистра.Период) КАК КоличествоДублирующихсяЗаписей
	|ГДЕ
	|	КоличествоДублирующихсяЗаписей.КоличествоПериодов > 1");
	
	Запрос.УстановитьПараметр("ГоловнаяОрганизация", Организация.ГоловнаяОрганизация);
	Запрос.УстановитьПараметр("Организация",		 Организация);	

	Возврат Запрос.Выполнить().Пустой();

КонецФункции

Процедура ОбработатьРегистрДляВеденияУчетаПоГоловнойОрганизации(Организация, ИмяРегистра, ПредставлениеРегистра, ВключениеВеденияУчетаПоГоловнойОрганизации)
		
	// Обработаем регистр
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ТаблицаРегистра.Регистратор,
	|	ПРЕДСТАВЛЕНИЕ(ТаблицаРегистра.Регистратор) КАК ПредставлениеДок,
	|	ТаблицаРегистра.НомерСтроки
	|ИЗ
	|	РегистрСведений." + ИмяРегистра + " КАК ТаблицаРегистра";
	Если ВключениеВеденияУчетаПоГоловнойОрганизации Тогда
		Запрос.Текст = Запрос.Текст + "
			|ГДЕ
			|	ТаблицаРегистра.Организация = &Организация
			|	И НЕ ТаблицаРегистра.Организация = &ГоловнаяОрганизация";
	Иначе
		Запрос.Текст = Запрос.Текст + "
			|ГДЕ
			|	ТаблицаРегистра.ОбособленноеПодразделение = &Организация
			|	И НЕ ТаблицаРегистра.Организация = &Организация";
	КонецЕсли;
	Запрос.Текст = Запрос.Текст + "
	|УПОРЯДОЧИТЬ ПО
	|	Регистратор,
	|	НомерСтроки
	|";

	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ГоловнаяОрганизация", Организация.ГоловнаяОрганизация);
	Выборка = Запрос.Выполнить().Выбрать();
	ЕстьДанные = Выборка.Следующий();	
	
	НаборЗаписей = РегистрыСведений[ИмяРегистра].СоздатьНаборЗаписей();

	Пока ЕстьДанные Цикл
	
		ТекущийРегистратор = Выборка.Регистратор;
		НаборЗаписей.Отбор.Регистратор.Значение = ТекущийРегистратор;
		НаборЗаписей.Отбор.Регистратор.Использование = Истина;
		НаборЗаписей.Прочитать();
		
		Пока ЕстьДанные
				И Выборка.Регистратор = ТекущийРегистратор Цикл
			
			Если Выборка.НомерСтроки <= НаборЗаписей.Количество() Тогда
				ЗаписьНабора = НаборЗаписей[Выборка.НомерСтроки - 1];
				
				Если ВключениеВеденияУчетаПоГоловнойОрганизации Тогда
					ЗаписьНабора.Организация = ЗаписьНабора.Организация.ГоловнаяОрганизация;				
				Иначе				
					ЗаписьНабора.Организация = ЗаписьНабора.ОбособленноеПодразделение;				
				КонецЕсли;
				
			КонецЕсли;
				
			ЕстьДанные = Выборка.Следующий();
		КонецЦикла;
		
		// записываем набор 
		Если НаборЗаписей.Модифицированность() Тогда
			Попытка
				НаборЗаписей.Записать();
				НаборЗаписей.Очистить();
			Исключение
				ОбщегоНазначения.СообщитьПользователю(
					СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Не удалось обработать регистр сведений: ""%1"".
						|По причине: %2'")
						, ПредставлениеРегистра, ОписаниеОшибки())
				);
			КонецПопытки;
		КонецЕсли;
			
	КонецЦикла; 
	
КонецПроцедуры

#КонецЕсли
